# 10 Minutes to Pandas

A notebook working through the Pandas tutorial [here](http://pandas.pydata.org/pandas-docs/stable/10min.html).  Once done can be used to try out other keyword arguments.


# Import

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Object Creation

In [3]:
# Series creation

s = pd.Series([7,8,5,np.nan])
s

0    7.0
1    8.0
2    5.0
3    NaN
dtype: float64

In [4]:
# Dataframe creation

dates = pd.date_range('20160520',periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2016-05-20  0.414935  1.352776 -0.232569  0.353327
2016-05-21 -1.179574  1.820783  1.383902  1.526480
2016-05-22  0.733275 -0.006070 -0.113749 -1.900577
2016-05-23 -0.287651  0.480695 -0.138876  0.074229
2016-05-24 -1.412152  2.658966 -0.844879 -0.758143
2016-05-25  1.282344  1.455651 -2.113368  0.148969

In [5]:
# Dataframe creation using dictionaries
kv={'A' : 2.,
    'B' : pd.Timestamp('20160605'),
    'C' : s,
    'D' : np.array([4,3,5,2],dtype='int32'),
    'E' : pd.Categorical(['foo','bar','fizz','buzz']),
    'F' : 'lorem ipsum'
   }
dict_df= pd.DataFrame(kv)
dict_df

     A          B    C  D     E            F
0  2.0 2016-06-05  7.0  4   foo  lorem ipsum
1  2.0 2016-06-05  8.0  3   bar  lorem ipsum
2  2.0 2016-06-05  5.0  5  fizz  lorem ipsum
3  2.0 2016-06-05  NaN  2  buzz  lorem ipsum

In [6]:
# Get data types
dict_df.dtypes

A           float64
B    datetime64[ns]
C           float64
D             int32
E          category
F            object
dtype: object

# Viewing Data

In [7]:
# Head of dataframe

dict_df.head()

     A          B    C  D     E            F
0  2.0 2016-06-05  7.0  4   foo  lorem ipsum
1  2.0 2016-06-05  8.0  3   bar  lorem ipsum
2  2.0 2016-06-05  5.0  5  fizz  lorem ipsum
3  2.0 2016-06-05  NaN  2  buzz  lorem ipsum

In [8]:
# Tail of dataframe

dict_df.tail(3)

     A          B    C  D     E            F
1  2.0 2016-06-05  8.0  3   bar  lorem ipsum
2  2.0 2016-06-05  5.0  5  fizz  lorem ipsum
3  2.0 2016-06-05  NaN  2  buzz  lorem ipsum

In [9]:
# Display columns

dict_df.columns

Index([u'A', u'B', u'C', u'D', u'E', u'F'], dtype='object')

In [10]:
# Display data

dict_df.values

array([[2.0, Timestamp('2016-06-05 00:00:00'), 7.0, 4, 'foo', 'lorem ipsum'],
       [2.0, Timestamp('2016-06-05 00:00:00'), 8.0, 3, 'bar', 'lorem ipsum'],
       [2.0, Timestamp('2016-06-05 00:00:00'), 5.0, 5, 'fizz',
        'lorem ipsum'],
       [2.0, Timestamp('2016-06-05 00:00:00'), nan, 2, 'buzz',
        'lorem ipsum']], dtype=object)

In [11]:
# Display row indices

dict_df.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
# Describe

dict_df.describe()

/Users/john/anaconda/lib/python2.7/site-packages/numpy/lib/function_base.py:3823: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

         A         C         D
count  4.0  3.000000  4.000000
mean   2.0  6.666667  3.500000
std    0.0  1.527525  1.290994
min    2.0  5.000000  2.000000
25%    2.0       NaN  2.750000
50%    2.0       NaN  3.500000
75%    2.0       NaN  4.250000
max    2.0  8.000000  5.000000

In [13]:
# Transpose

dict_df.T

,0,1,2,3
A,2,2,2,2
B,2016-06-05 00:00:00,2016-06-05 00:00:00,2016-06-05 00:00:00,2016-06-05 00:00:00
C,7,8,5,NaN
D,4,3,5,2
E,foo,bar,fizz,buzz
F,lorem ipsum,lorem ipsum,lorem ipsum,lorem ipsum

In [14]:
# Sort by index or column name

dict_df.sort_index(axis=0,ascending=False)

     A          B    C  D     E            F
3  2.0 2016-06-05  NaN  2  buzz  lorem ipsum
2  2.0 2016-06-05  5.0  5  fizz  lorem ipsum
1  2.0 2016-06-05  8.0  3   bar  lorem ipsum
0  2.0 2016-06-05  7.0  4   foo  lorem ipsum

In [15]:
# Sort by values
# New in 0.18; older versions use 'sort'

dict_df.sort_values(by='D')

     A          B    C  D     E            F
3  2.0 2016-06-05  NaN  2  buzz  lorem ipsum
1  2.0 2016-06-05  8.0  3   bar  lorem ipsum
0  2.0 2016-06-05  7.0  4   foo  lorem ipsum
2  2.0 2016-06-05  5.0  5  fizz  lorem ipsum

# Selection

## Getting

In [16]:
dict_df['A']

0    2.0
1    2.0
2    2.0
3    2.0
Name: A, dtype: float64

In [17]:
# Fascinating

dict_df['A']==dict_df.A

0    True
1    True
2    True
3    True
Name: A, dtype: bool

In [18]:
# Row slicing

df[0:2]

                   A         B         C         D
2016-05-20  0.414935  1.352776 -0.232569  0.353327
2016-05-21 -1.179574  1.820783  1.383902  1.526480

In [19]:
df['20160520':'20160523']

                   A         B         C         D
2016-05-20  0.414935  1.352776 -0.232569  0.353327
2016-05-21 -1.179574  1.820783  1.383902  1.526480
2016-05-22  0.733275 -0.006070 -0.113749 -1.900577
2016-05-23 -0.287651  0.480695 -0.138876  0.074229

In [20]:
# Robust to dates that precede first recorded date in the dataframe

df['20130228':'20160520']

                   A         B         C         D
2016-05-20  0.414935  1.352776 -0.232569  0.353327

## Selection by Label

In [21]:
# .loc is for labels
firstdate=pd.tslib.Timestamp(('20160520'))
df.loc[firstdate]

A    0.414935
B    1.352776
C   -0.232569
D    0.353327
Name: 2016-05-20 00:00:00, dtype: float64

In [22]:
# Select two axes by label
df.loc[:,['D','C']]

                   D         C
2016-05-20  0.353327 -0.232569
2016-05-21  1.526480  1.383902
2016-05-22 -1.900577 -0.113749
2016-05-23  0.074229 -0.138876
2016-05-24 -0.758143 -0.844879
2016-05-25  0.148969 -2.113368

In [23]:
# Both endpoints are included in date slicing

df.loc['20160522':'20160524',['D','C']]

                   D         C
2016-05-22 -1.900577 -0.113749
2016-05-23  0.074229 -0.138876
2016-05-24 -0.758143 -0.844879

In [24]:
# Return scalar

df.loc[firstdate,'C']

-0.23256921129763006

In [25]:
# Return scalar, but quickly (how exactly? / why would you want to use .loc for returning scalars then)

df.at[firstdate,'C']

-0.23256921129763006

## Selection by Position

In [26]:
# By int position
df.iloc[2]

A    0.733275
B   -0.006070
C   -0.113749
D   -1.900577
Name: 2016-05-22 00:00:00, dtype: float64

In [27]:
# Slice me nice; r,c
df.iloc[0:3,1:3]

                   B         C
2016-05-20  1.352776 -0.232569
2016-05-21  1.820783  1.383902
2016-05-22 -0.006070 -0.113749

In [28]:
# Using lists

df.iloc[[1,3,4],2:4]

                   C         D
2016-05-21  1.383902  1.526480
2016-05-23 -0.138876  0.074229
2016-05-24 -0.844879 -0.758143

In [29]:
# Row slicing

df.iloc[2:5,:]

                   A         B         C         D
2016-05-22  0.733275 -0.006070 -0.113749 -1.900577
2016-05-23 -0.287651  0.480695 -0.138876  0.074229
2016-05-24 -1.412152  2.658966 -0.844879 -0.758143

In [30]:
# Column slicing

df.iloc[:,0:3]

                   A         B         C
2016-05-20  0.414935  1.352776 -0.232569
2016-05-21 -1.179574  1.820783  1.383902
2016-05-22  0.733275 -0.006070 -0.113749
2016-05-23 -0.287651  0.480695 -0.138876
2016-05-24 -1.412152  2.658966 -0.844879
2016-05-25  1.282344  1.455651 -2.113368

In [31]:
# Value access

df.iloc[0,0]

0.41493528741995495

In [32]:
# ... and assignment
df.iloc[0,0]=50
df

                    A         B         C         D
2016-05-20  50.000000  1.352776 -0.232569  0.353327
2016-05-21  -1.179574  1.820783  1.383902  1.526480
2016-05-22   0.733275 -0.006070 -0.113749 -1.900577
2016-05-23  -0.287651  0.480695 -0.138876  0.074229
2016-05-24  -1.412152  2.658966 -0.844879 -0.758143
2016-05-25   1.282344  1.455651 -2.113368  0.148969

In [33]:
# Fast access

df.iat[0,0]

50.0

## Boolean Indexing

In [34]:
# Data returned based off of column

df[df.A > 0]

                    A         B         C         D
2016-05-20  50.000000  1.352776 -0.232569  0.353327
2016-05-22   0.733275 -0.006070 -0.113749 -1.900577
2016-05-25   1.282344  1.455651 -2.113368  0.148969

In [35]:
# Indexing by condition

df[df == 5]

             A   B   C   D
2016-05-20 NaN NaN NaN NaN
2016-05-21 NaN NaN NaN NaN
2016-05-22 NaN NaN NaN NaN
2016-05-23 NaN NaN NaN NaN
2016-05-24 NaN NaN NaN NaN
2016-05-25 NaN NaN NaN NaN

In [36]:
# Filtering with isin()
df['E'] = [1,4,3,2,5,7]
df[df['E'].isin([1,4])]

                    A         B         C         D  E
2016-05-20  50.000000  1.352776 -0.232569  0.353327  1
2016-05-21  -1.179574  1.820783  1.383902  1.526480  4

In [37]:
# Filtering without isin()

df[(df.E == 1) | (df.E == 4)]

                    A         B         C         D  E
2016-05-20  50.000000  1.352776 -0.232569  0.353327  1
2016-05-21  -1.179574  1.820783  1.383902  1.526480  4

## Setting

In [38]:
# Adding a new column

s1 = pd.Series([3,5,3,4,2,1], index=pd.date_range('20160520',periods=6))
s1
df['F']=s1
df

                    A         B         C         D  E  F
2016-05-20  50.000000  1.352776 -0.232569  0.353327  1  3
2016-05-21  -1.179574  1.820783  1.383902  1.526480  4  5
2016-05-22   0.733275 -0.006070 -0.113749 -1.900577  3  3
2016-05-23  -0.287651  0.480695 -0.138876  0.074229  2  4
2016-05-24  -1.412152  2.658966 -0.844879 -0.758143  5  2
2016-05-25   1.282344  1.455651 -2.113368  0.148969  7  1

In [39]:
# Setting by label
df.at[firstdate,'D']=0
df

                    A         B         C         D  E  F
2016-05-20  50.000000  1.352776 -0.232569  0.000000  1  3
2016-05-21  -1.179574  1.820783  1.383902  1.526480  4  5
2016-05-22   0.733275 -0.006070 -0.113749 -1.900577  3  3
2016-05-23  -0.287651  0.480695 -0.138876  0.074229  2  4
2016-05-24  -1.412152  2.658966 -0.844879 -0.758143  5  2
2016-05-25   1.282344  1.455651 -2.113368  0.148969  7  1

In [40]:
# Setting by position
df.iat[1,3]=50
df

                    A         B         C          D  E  F
2016-05-20  50.000000  1.352776 -0.232569   0.000000  1  3
2016-05-21  -1.179574  1.820783  1.383902  50.000000  4  5
2016-05-22   0.733275 -0.006070 -0.113749  -1.900577  3  3
2016-05-23  -0.287651  0.480695 -0.138876   0.074229  2  4
2016-05-24  -1.412152  2.658966 -0.844879  -0.758143  5  2
2016-05-25   1.282344  1.455651 -2.113368   0.148969  7  1

In [41]:
# Assign using numpy array

df.loc[:,'D']=np.array([4,2,3,1,1,1])
df

                    A         B         C  D  E  F
2016-05-20  50.000000  1.352776 -0.232569  4  1  3
2016-05-21  -1.179574  1.820783  1.383902  2  4  5
2016-05-22   0.733275 -0.006070 -0.113749  3  3  3
2016-05-23  -0.287651  0.480695 -0.138876  1  2  4
2016-05-24  -1.412152  2.658966 -0.844879  1  5  2
2016-05-25   1.282344  1.455651 -2.113368  1  7  1

In [42]:
# Assign using a regular list?

df.loc[:,'D']=[5,5,5,2,2,2]
df

# Yes!

                    A         B         C  D  E  F
2016-05-20  50.000000  1.352776 -0.232569  5  1  3
2016-05-21  -1.179574  1.820783  1.383902  5  4  5
2016-05-22   0.733275 -0.006070 -0.113749  5  3  3
2016-05-23  -0.287651  0.480695 -0.138876  2  2  4
2016-05-24  -1.412152  2.658966 -0.844879  2  5  2
2016-05-25   1.282344  1.455651 -2.113368  2  7  1

In [43]:
# Copy a dataframe and then apply a 'where' operation to it (like thresholding)

df2 = df.copy()
df2 = df2[df2 < 0]
df2

                   A        B         C   D   E   F
2016-05-20       NaN      NaN -0.232569 NaN NaN NaN
2016-05-21 -1.179574      NaN       NaN NaN NaN NaN
2016-05-22       NaN -0.00607 -0.113749 NaN NaN NaN
2016-05-23 -0.287651      NaN -0.138876 NaN NaN NaN
2016-05-24 -1.412152      NaN -0.844879 NaN NaN NaN
2016-05-25       NaN      NaN -2.113368 NaN NaN NaN

In [44]:
# Convert all the NaNs to zeros.

df2.fillna(0)

                   A        B         C    D    E    F
2016-05-20  0.000000  0.00000 -0.232569  0.0  0.0  0.0
2016-05-21 -1.179574  0.00000  0.000000  0.0  0.0  0.0
2016-05-22  0.000000 -0.00607 -0.113749  0.0  0.0  0.0
2016-05-23 -0.287651  0.00000 -0.138876  0.0  0.0  0.0
2016-05-24 -1.412152  0.00000 -0.844879  0.0  0.0  0.0
2016-05-25  0.000000  0.00000 -2.113368  0.0  0.0  0.0

## Missing Data

In [45]:
# Reindexing

df1 = df.reindex(dates[0:4], columns=list(df.columns) + ['G'])
df1.loc[dates[1]:dates[2],'G'] = 1
df1

                    A         B         C  D  E  F    G
2016-05-20  50.000000  1.352776 -0.232569  5  1  3  NaN
2016-05-21  -1.179574  1.820783  1.383902  5  4  5  1.0
2016-05-22   0.733275 -0.006070 -0.113749  5  3  3  1.0
2016-05-23  -0.287651  0.480695 -0.138876  2  2  4  NaN

In [46]:
df1.dropna(how='any')

                   A         B         C  D  E  F    G
2016-05-21 -1.179574  1.820783  1.383902  5  4  5  1.0
2016-05-22  0.733275 -0.006070 -0.113749  5  3  3  1.0

In [47]:
df1.fillna(value=100)

                    A         B         C  D  E  F      G
2016-05-20  50.000000  1.352776 -0.232569  5  1  3  100.0
2016-05-21  -1.179574  1.820783  1.383902  5  4  5    1.0
2016-05-22   0.733275 -0.006070 -0.113749  5  3  3    1.0
2016-05-23  -0.287651  0.480695 -0.138876  2  2  4  100.0

In [48]:
pd.isnull(df1)

                A      B      C      D      E      F      G
2016-05-20  False  False  False  False  False  False   True
2016-05-21  False  False  False  False  False  False  False
2016-05-22  False  False  False  False  False  False  False
2016-05-23  False  False  False  False  False  False   True

# Operations

## Stats

In [49]:
# Descriptives

df.mean()

A    8.189374
B    1.293800
C   -0.343256
D    3.500000
E    3.666667
F    3.000000
dtype: float64

In [50]:
# On other axis

df.mean(1)

2016-05-20    10.020035
2016-05-21     2.670852
2016-05-22     1.935576
2016-05-23     1.342361
2016-05-24     1.566989
2016-05-25     1.770771
Freq: D, dtype: float64

In [51]:
# Same as first call with no arguments

df.mean(0)

A    8.189374
B    1.293800
C   -0.343256
D    3.500000
E    3.666667
F    3.000000
dtype: float64

In [52]:
print dates

DatetimeIndex(['2016-05-20', '2016-05-21', '2016-05-22', '2016-05-23',
               '2016-05-24', '2016-05-25'],
              dtype='datetime64[ns]', freq='D')

In [53]:
# Shift the series forward 2 columns and assign NaNs to previous positions.

s = pd.Series([1,4,5,np.nan,6,8], index=dates).shift(2)
s

2016-05-20    NaN
2016-05-21    NaN
2016-05-22    1.0
2016-05-23    4.0
2016-05-24    5.0
2016-05-25    NaN
Freq: D, dtype: float64

In [54]:
# The original

df

                    A         B         C  D  E  F
2016-05-20  50.000000  1.352776 -0.232569  5  1  3
2016-05-21  -1.179574  1.820783  1.383902  5  4  5
2016-05-22   0.733275 -0.006070 -0.113749  5  3  3
2016-05-23  -0.287651  0.480695 -0.138876  2  2  4
2016-05-24  -1.412152  2.658966 -0.844879  2  5  2
2016-05-25   1.282344  1.455651 -2.113368  2  7  1

In [55]:
# Subtract the shifted series

df.sub(s, axis='index')

                   A         B         C    D    E    F
2016-05-20       NaN       NaN       NaN  NaN  NaN  NaN
2016-05-21       NaN       NaN       NaN  NaN  NaN  NaN
2016-05-22 -0.266725 -1.006070 -1.113749  4.0  2.0  2.0
2016-05-23 -4.287651 -3.519305 -4.138876 -2.0 -2.0  0.0
2016-05-24 -6.412152 -2.341034 -5.844879 -3.0  0.0 -3.0
2016-05-25       NaN       NaN       NaN  NaN  NaN  NaN

## Apply

In [56]:
# Apply Numpy's cumulative sum function to all columns in the dataframe.

df.apply(np.cumsum)

                    A         B         C   D   E   F
2016-05-20  50.000000  1.352776 -0.232569   5   1   3
2016-05-21  48.820426  3.173560  1.151333  10   5   8
2016-05-22  49.553702  3.167490  1.037584  15   8  11
2016-05-23  49.266051  3.648185  0.898708  17  10  15
2016-05-24  47.853898  6.307151  0.053830  19  15  17
2016-05-25  49.136242  7.762802 -2.059538  21  22  18

In [57]:
df.apply(lambda x: x['2016-05-21'] - x['2016-05-20'])

A   -51.179574
B     0.468007
C     1.616471
D     0.000000
E     3.000000
F     2.000000
dtype: float64

In [58]:
df.apply(lambda x: x.max() - x.min())

A    51.412152
B     2.665036
C     3.497270
D     3.000000
E     6.000000
F     4.000000
dtype: float64

## Histogramming

In [59]:
# Make a series of length 10 filled with random integers.
s = pd.Series(np.random.randint(0,7,size=10))
s

0    2
1    5
2    2
3    2
4    2
5    6
6    6
7    3
8    6
9    3
dtype: int64

In [60]:
# Get the counts for each value.
s.value_counts()

2    4
6    3
3    2
5    1
dtype: int64

## String methods

In [61]:
s = pd.Series(['Howard','James','Vladimir','Marv','Carl','Isaac'])

In [62]:
s.str.lower()

0      howard
1       james
2    vladimir
3        marv
4        carl
5       isaac
dtype: object

In [63]:
s.str.upper()

0      HOWARD
1       JAMES
2    VLADIMIR
3        MARV
4        CARL
5       ISAAC
dtype: object

In [64]:
s.str.contains('ar')

0     True
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [65]:
s[s.str.contains('ar')]

0    Howard
3      Marv
4      Carl
dtype: object

# Merge

## Concat

In [66]:
first_df = pd.DataFrame(np.random.randn(4,2))
first_df

          0         1
0  1.235015 -0.264326
1  1.010157 -0.723565
2 -0.212279  1.223960
3  1.699897 -0.366932

In [67]:
second_df = pd.DataFrame(np.random.randn(4,2))
second_df

          0         1
0  0.828003  0.051405
1 -2.164969 -0.240971
2 -0.520756 -0.044311
3 -1.094866 -1.175236

In [68]:
pd.concat([first_df,second_df])

          0         1
0  1.235015 -0.264326
1  1.010157 -0.723565
2 -0.212279  1.223960
3  1.699897 -0.366932
0  0.828003  0.051405
1 -2.164969 -0.240971
2 -0.520756 -0.044311
3 -1.094866 -1.175236

In [69]:
# What happens when the columns don't match?

third_df = pd.DataFrame(np.random.randn(4,3))
third_df

          0         1         2
0 -1.585364 -0.594743 -0.387601
1 -0.581789  0.184825 -0.004704
2 -0.178480  1.469666  0.135427
3  0.589534 -0.100372  0.087590

In [70]:
pd.concat([first_df,third_df])

          0         1         2
0  1.235015 -0.264326       NaN
1  1.010157 -0.723565       NaN
2 -0.212279  1.223960       NaN
3  1.699897 -0.366932       NaN
0 -1.585364 -0.594743 -0.387601
1 -0.581789  0.184825 -0.004704
2 -0.178480  1.469666  0.135427
3  0.589534 -0.100372  0.087590

## Join

In [72]:
left = pd.DataFrame({'Person': ['Alex','Jake','George'], 'Farts' : [20,2,4]})

   Farts  Person
0     20    Alex
1      2    Jake
2      4  George

In [80]:
right = pd.DataFrame({'Person' : ['Jake','Alex'], 'Food' : [2,500]})

In [81]:
left

   Farts  Person
0     20    Alex
1      2    Jake
2      4  George

In [82]:
right

   Food Person
0     2   Jake
1   500   Alex

In [96]:
df = pd.merge(left,right,on='Person')
df

   Farts Person  Food
0     20   Alex   500
1      2   Jake     2

## Append

In [97]:
s = df.iloc[1]

In [98]:
df.append(s)

   Farts Person  Food
0     20   Alex   500
1      2   Jake     2
1      2   Jake     2

In [99]:
# Not an in place operation
df

   Farts Person  Food
0     20   Alex   500
1      2   Jake     2

In [100]:
df = df.append(s)
df

   Farts Person  Food
0     20   Alex   500
1      2   Jake     2
1      2   Jake     2

# Grouping

In [107]:
df = pd.DataFrame( { 'Cheese' : ['Swiss','Cheddar','Cheddar','Swiss','Brie'],
                     'Region' : ['New York','New York','UK','France','France'],
                     'Acidity' : np.random.randn(5),
                     'Yumminess' : np.random.randn(5)})
df

    Acidity   Cheese    Region  Yumminess
0 -0.558624    Swiss  New York  -0.075420
1 -0.977508  Cheddar  New York   0.253099
2 -0.475811  Cheddar        UK   1.078542
3 -0.902090    Swiss    France   0.521781
4  0.880299     Brie    France   1.680226

In [108]:
# Group and apply sum to groups
df.groupby('Region').sum()

           Acidity  Yumminess
Region
France   -0.021791   2.202007
New York -1.536133   0.177678
UK       -0.475811   1.078542

In [105]:
df.groupby('Region').mean()

           Acidity  Yumminess
Region
France    0.226732  -0.870958
Italy    -0.359873   0.752381
New York  0.826561   0.489027

In [111]:
# Suck it, SPSS!
df.groupby(['Region','Cheese']).mean()

                   Acidity  Yumminess
Region   Cheese
France   Brie     0.880299   1.680226
         Swiss   -0.902090   0.521781
New York Cheddar -0.977508   0.253099
         Swiss   -0.558624  -0.075420
UK       Cheddar -0.475811   1.078542

# Reshaping

## Stacking

In [112]:
tuples = list(zip(*[['bar','bar','foo','foo',
                    'buzz','buzz','bazz','bazz'],
                   ['unu','du','unu','du',
                   'unu','du','unu','du']]))

In [118]:
index = pd.MultiIndex.from_tuples(tuples,names=['premier','deuxieme'])

In [123]:
df = pd.DataFrame(np.random.randn(8,2),index=index,columns=['A','Bo'])
df

                         A        Bo
premier deuxieme
bar     unu       0.415654 -0.453137
        du       -0.224624  1.130491
foo     unu       0.392338  0.382815
        du        0.489422  0.119542
buzz    unu       0.116365  0.310796
        du       -0.417861 -1.637499
bazz    unu       2.895165  0.451545
        du       -1.410978 -0.624734

In [124]:
df2 = df[:4]
df2

                         A        Bo
premier deuxieme
bar     unu       0.415654 -0.453137
        du       -0.224624  1.130491
foo     unu       0.392338  0.382815
        du        0.489422  0.119542

In [127]:
stacked = df2.stack()
stacked

premier  deuxieme
bar      unu       A     0.415654
                   Bo   -0.453137
         du        A    -0.224624
                   Bo    1.130491
foo      unu       A     0.392338
                   Bo    0.382815
         du        A     0.489422
                   Bo    0.119542
dtype: float64

In [128]:
# Unstack
stacked.unstack()

                         A        Bo
premier deuxieme
bar     du       -0.224624  1.130491
        unu       0.415654 -0.453137
foo     du        0.489422  0.119542
        unu       0.392338  0.382815

In [129]:
stacked.unstack(0)

premier           bar       foo
deuxieme
du       A  -0.224624  0.489422
         Bo  1.130491  0.119542
unu      A   0.415654  0.392338
         Bo -0.453137  0.382815

In [130]:
stacked.unstack(1)

deuxieme          du       unu
premier
bar     A  -0.224624  0.415654
        Bo  1.130491 -0.453137
foo     A   0.489422  0.392338
        Bo  0.119542  0.382815

## Pivot Tables

In [134]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'bar', 'bar'] * 3,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo  0.960148  0.089658
1     one  B  foo  0.023367  0.214031
2     two  C  bar -1.624965 -0.183453
3   three  A  bar -0.413454  1.114684
4     one  B  foo -0.414575  0.605551
5     one  C  foo -0.452260 -0.464107
6     two  A  bar -0.981653 -0.653864
7   three  B  bar -1.563984  0.136208
8     one  C  foo -0.496569 -0.043181
9     one  A  foo  0.390532 -0.561939
10    two  B  bar -0.063684 -1.150815
11  three  C  bar -0.869725 -0.699229

In [135]:
pd.pivot_table(df, values='E', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A       NaN -0.236141
      B       NaN  0.409791
      C       NaN -0.253644
three A  1.114684       NaN
      B  0.136208       NaN
      C -0.699229       NaN
two   A -0.653864       NaN
      B -1.150815       NaN
      C -0.183453       NaN

In [ ]:
pd.pivot_table(df, values='E', index=['A', 'B'], columns=['C'])